admin_panel/ADMIN_QUESTIONLIST_DELECTION_TESTING/admin_QuestionList_DELECTION_testing-Combined-JMeter-and-Selenium.yaml
---
# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: admin_QuestionList_DELECTION_testing-Selenium
  hold-for: 20m

- executor: jmeter
  scenario: admin_QuestionList_DELECTION_testing-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  admin_QuestionList_DELECTION_testing-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://localhost:33143/Administator/QuestionList)
      # WARN: Command Not yet supported. ('chooseOkOnNextConfirmation:"":""')
      - clickByXPath(//table[@id='question']/tbody/tr[5]/td[5]/button)
      # WARN: Command Not yet supported. ('assertConfirmation:"Do you want to delete":""')
      # WARN: Command Not yet supported. ('chooseOkOnNextConfirmation:"":""')
      - clickByXPath(//table[@id='question']/tbody/tr[4]/td[5]/button)
      # WARN: Command Not yet supported. ('assertConfirmation:"Do you want to delete":""')

  admin_QuestionList_DELECTION_testing-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.98 Safari/537.36'
      Referer: 'http://localhost:33143/Administator/QuestionList'
      Accept-Encoding: 'gzip, deflate, br'
      Accept-Language: 'en-US,en;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:33143/Administator/UserSignUp/1004'
            method: GET
            label: 'http://localhost:33143/Administator/UserSignUp/1004'
            headers: {}
          - url: 'http://localhost:33143/Administator/UserSignUp/4'
            method: GET
            label: 'http://localhost:33143/Administator/UserSignUp/4'
            headers: {}